Autodesk.Revit.DB.Structure.RebarCoupler.GetCouplerPositionTransform(System.Int32)
Return a transform representing the relative position of the coupler at index couplerPositionIndex in the set.
Remarks:
The transform is a translation along the distribution path and a rotation what will align coupler with the bar segment on which stays
couplerPositionIndex:
An index between 0 and (CouplerQuantity-1).
Returns:
The position of a coupler in the set relative (0,0,0).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
couplerPositionIndex is not in the range [ 0, CouplerQuantity-1 ].
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler.GetCoupledReinforcementData
gets the reinforcement data. If coupler stays on one bar the list will have size = 1. If coupler connects two bars the size will be 2.
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.ReinforcementData,Autodesk.Revit.DB.Structure.ReinforcementData,Autodesk.Revit.DB.Structure.RebarCouplerError@)
Creates a new instance of a Rebar Coupler element within the project.
doc:
A document.
typeId:
type id for coupler
pFirstData:
information about the first reinforcement to be coupled
pSecondData:
information about the second reinforcement to be coupled; for the default value, coupler is placed on one reinforcement
error:
will be ValidationSuccesfully(0) if ok, otherwise the failure reason
Returns:
The newly created Rebar Coupler instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017